# DataFrame에서 데이터 추출

 - 열(컬럼:column 세로벡터) 단위 데이터 추출
   - 방식 : DF객체변수명.[컬럼명] 또는 DF객체면수명.컬럼명
 
 - 행(로우:row 가로벡터) 단위 데이터 추출
   - 방식 : DF객체변수명.loc[ 인덱스라벨 ] 또는 DF객체변수명.iloc[ 정수인덱스 ]
 
 - 원소 단위 데이터 추출
   - 방식 
     - DF객체변수명.loc[ 행인덱스라벨, 열인덱스라벨 ] 또는 DF객체변수명.loc[ 행인덱스라벨]
     - DF객체면수명.iloc[ 행인덱스, 열인덱스 ] 또는 DF객체면수명.iloc[행인덱스][열인덱스]

In [2]:
# 모듈 로딩
import pandas as pd

# DF객체 생성
df=pd.DataFrame([[1,2,3],[11,22,33]])

# DF객체 요약 정보 출력 메서드
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
dtypes: int64(3)
memory usage: 176.0 bytes

In [3]:
# DF객체 구성 확인
df

    0   1   2
0   1   2   3
1  11  22  33

In [6]:
# 열(세로) 데이터 추출
# DF객체면수명[컬럼명]
oneCol=df[0]
print(f'oneCol =>\n{oneCol}', f'oneCol Type => {type(oneCol)}', sep='\n')

oneCol => 0     1
1    11
Name: 0, dtype: int64
oneCol Type => <class 'pandas.core.series.Series'>

In [8]:
twoCol=df[[0,2]]
print(f'oneCol =>\n{twoCol}', f'oneCol Type => {type(twoCol)}', sep='\n')

oneCol =>     0   2
0   1   3
1  11  33
oneCol Type => <class 'pandas.core.frame.DataFrame'>

In [10]:
twoCol=df[0:2]
print(f'oneCol =>\n{twoCol}', f'oneCol Type => {type(twoCol)}', sep='\n')

oneCol =>     0   1   2
0   1   2   3
1  11  22  33
oneCol Type => <class 'pandas.core.frame.DataFrame'>

In [11]:
# DF객체의 columns 속성 변경
df.columns=['one','two','three']
df

   one  two  three
0    1    2      3
1   11   22     33

# 행(row, 가로) 데이터 추출

 - DF객체변수명.loc[  ] 또는 DF객체변수명.iloc[  ]

In [12]:
# DF객체 데이터 확인
df

   one  two  three
0    1    2      3
1   11   22     33

In [19]:
# 11, 22, 33 라인 전체 추출
oneRow=df.iloc[1]

print(f'oneRow =>\n{oneRow}', f'oneRow Type => {type(oneRow)}', sep='\n')

oneRow =>
one      11
two      22
three    33
Name: 1, dtype: int64
oneRow Type => <class 'pandas.core.series.Series'>

In [22]:
oneRow=df.loc[1]
print(f'oneRow =>\n{oneRow}', f'oneRow Type => {type(oneRow)}', sep='\n')

oneRow =>
one      11
two      22
three    33
Name: 1, dtype: int64
oneRow Type => <class 'pandas.core.series.Series'>

In [27]:
twoRow=df.iloc[[0,1]]
print(f'twoRow =>\n{twoRow}', f'twoRow Type => {type(twoRow)}', sep='\n')

twoRow =>
   one  two  three
0    1    2      3
1   11   22     33
twoRow Type => <class 'pandas.core.frame.DataFrame'>

In [32]:
# 성적 DF객체 생성

data={'수학':[90,80,70],'영어':[98,89,95],'음악':[85,95,100],'체육':[100,90,90]}
df=pd.DataFrame(data, index=['서준','우현','인아'])
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 서준 to 인아
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
dtypes: int64(4)
memory usage: 120.0+ bytes

In [34]:
# 우현학생의 성적만 추출
df.loc['우현']

수학    80
영어    89
음악    95
체육    90
Name: 우현, dtype: int64

In [36]:
# 인아학생의 성적만 추출
df.iloc[2]

수학     70
영어     95
음악    100
체육     90
Name: 인아, dtype: int64

In [37]:
# 음악과목의 성적만 추출
df['음악']

서준     85
우현     95
인아    100
Name: 음악, dtype: int64

In [38]:
df.음악

서준     85
우현     95
인아    100
Name: 음악, dtype: int64

In [42]:
# 우현학생의 음악점수만 추출
df

95

In [46]:
# DF에서 원소 추출 => iloc[행,열] 또는 loc[행,열]

woo=df.loc['우현','음악']
print(f'woo => {woo}', f'woo type => {type(woo)}',sep='\n')

woo => 95
woo type => <class 'numpy.int64'>

In [47]:
woo=df.iloc[1,2]
print(f'woo => {woo}', f'woo type => {type(woo)}',sep='\n')

woo => 95
woo type => <class 'numpy.int64'>

In [49]:
woo=df.loc['우현']['음악']
print(f'woo => {woo}', f'woo type => {type(woo)}',sep='\n')

woo => 95
woo type => <class 'numpy.int64'>

In [50]:
woo=df.iloc[1][2]
print(f'woo => {woo}', f'woo type => {type(woo)}',sep='\n')

woo => 95
woo type => <class 'numpy.int64'>

In [56]:
woo=df['음악'][1]
print(f'woo => {woo}', f'woo type => {type(woo)}',sep='\n')

woo => 95
woo type => <class 'numpy.int64'>

In [58]:
select=df['수학'][2]
select

70

In [61]:
oneCol=df['수학']
oneCol[2]

70

# DF에 행과 열 추가하기

 - 행 추가 => DF객체변수명.loc[행라벨] = 데이터
 
 - 열 추가 => DF객체변수명[컬럼명] = 데이터

In [64]:
# DF데이터 확인
df2=df
df2

     수학   영어   음악   체육
서준   90   98   85  100
우현   80   89   95   90
인아   70   95  100   90
혜진  100  100  100  100

In [63]:
# 행(row) 추가하기
df2.loc['혜진']=[100,100,100,100]
df2

     수학   영어   음악   체육
서준   90   98   85  100
우현   80   89   95   90
인아   70   95  100   90
혜진  100  100  100  100

In [65]:
df2.loc['나령']=100
df2

     수학   영어   음악   체육
서준   90   98   85  100
우현   80   89   95   90
인아   70   95  100   90
혜진  100  100  100  100
나령  100  100  100  100

In [66]:
# 열(컬럼 column) 추가하기
df2['국어']=[100,100,100,100,100]
df2

     수학   영어   음악   체육   국어
서준   90   98   85  100  100
우현   80   89   95   90  100
인아   70   95  100   90  100
혜진  100  100  100  100  100
나령  100  100  100  100  100

In [67]:
df2['국어']=[0,0,0,0,0]
df2

     수학   영어   음악   체육  국어
서준   90   98   85  100   0
우현   80   89   95   90   0
인아   70   95  100   90   0
혜진  100  100  100  100   0
나령  100  100  100  100   0

In [69]:
df2['국어']=100
df2

     수학   영어   음악   체육   국어
서준   90   98   85  100  100
우현   80   89   95   90  100
인아   70   95  100   90  100
혜진  100  100  100  100  100
나령  100  100  100  100  100

# DF에서 행과 열 삭제하기

 - 삭제 관련 메서드
   - 행 삭제 : DF객체변수명.drop(행, axis=0)  <- axis=0 행 기본값
   - 열 삭제 : DF객체변수명.drop(열, axis=1)
      
 - drop() 특징
   - 실제 데이터 삭제하지 않음 -> 복사본에서 데이터 삭제하고 복사본 반환
   - 실제 데이터 삭제하기 -> inplace=True  //  False 기본값

In [70]:
df2

     수학   영어   음악   체육   국어
서준   90   98   85  100  100
우현   80   89   95   90  100
인아   70   95  100   90  100
혜진  100  100  100  100  100
나령  100  100  100  100  100

In [74]:
# 인아 학생 성적 제거 ==> 행(Row)
df2.drop('인아')

     수학   영어   음악   체육   국어
서준   90   98   85  100  100
우현   80   89   95   90  100
혜진  100  100  100  100  100
나령  100  100  100  100  100

In [75]:
df2

     수학   영어   음악   체육   국어
서준   90   98   85  100  100
우현   80   89   95   90  100
인아   70   95  100   90  100
혜진  100  100  100  100  100
나령  100  100  100  100  100

In [76]:
df3=df2.drop('인아')
df3

     수학   영어   음악   체육   국어
서준   90   98   85  100  100
우현   80   89   95   90  100
혜진  100  100  100  100  100
나령  100  100  100  100  100

In [79]:
# inplace=True  --> 원본 자체 삭제

df3.drop('서준', inplace=True)
df3

     수학   영어   음악   체육   국어
우현   80   89   95   90  100
혜진  100  100  100  100  100
나령  100  100  100  100  100

In [83]:
# inplace=True  --> 원본 자체 삭제, 반환값x 

df4=df3.drop('우현', inplace=True )
print(df4)

None

In [84]:
# 열 삭제 -> 수학 컬럼
# => DF객체변수명.drop(열, axis=1, inplace=True)

df3.drop('수학',axis=True)

     영어   음악   체육   국어
혜진  100  100  100  100
나령  100  100  100  100

# 행&열 전환

 - 행 ==> 열, 열 ==> 행으로 변환
 
 - 방법
   
   - 메서드 : DF객체변수명.transpose()
   - 속  성 : DF객체변수명.T

In [87]:
df2

     수학   영어   음악   체육   국어
서준   90   98   85  100  100
우현   80   89   95   90  100
인아   70   95  100   90  100
혜진  100  100  100  100  100
나령  100  100  100  100  100

In [89]:
# DF 객체의 형태 => shape 속성
df2.shape

(5, 5)

In [94]:
df2.T

     서준   우현   인아   혜진   나령
수학   90   80   70  100  100
영어   98   89   95  100  100
음악   85   95  100  100  100
체육  100   90   90  100  100
국어  100  100  100  100  100

In [95]:
df2

     수학   영어   음악   체육   국어
서준   90   98   85  100  100
우현   80   89   95   90  100
인아   70   95  100   90  100
혜진  100  100  100  100  100
나령  100  100  100  100  100

In [96]:
df2=df2.transpose()
df2

     서준   우현   인아   혜진   나령
수학   90   80   70  100  100
영어   98   89   95  100  100
음악   85   95  100  100  100
체육  100   90   90  100  100
국어  100  100  100  100  100